import os.path

from jinja2 import Environment, FileSystemLoader

# テンプレートの読み込み（outputディレクトリ内）
print(os.listdir())
env = Environment(loader=FileSystemLoader('output'))
template = env.get_template('table_template.html')

# 入力データ
data = [
    ['銘柄コード', 'AAPL', 'NASDAQ', 'IT・テクノロジー', 'テクノロジー'],
    ['2021-01-05', '2022-01-04', '2023-01-03', '2024-01-02', '2024-12-31'],
    ['終値', 128.10879516601562, 176.80381774902344, 123.76846313476562, 184.7349853515625, 250.4199981689453],
    ['配当金', 0.004, '配当利回り', 0.1612, 'PER', 41.119865, 3785298542592],
    ['決算日', '2024-09-30', '2023-09-30', '2022-09-30', '2021-09-30', '2020-09-30'],
    ['EPS', '', 6.16, 6.15, 5.67],
    ['自己資本比率 (%)', 15.603594717518767, 17.625920705195654, 14.364644016385311, 17.974256556942695],
    ['営業CF (百万)', 118254000000.0, 110543000000.0, 122151000000.0, 104038000000.0],
    ['ROE (%)', 1.6459350307287095, 1.5607601454639075, 1.9695887275023682, 1.5007132667617689],
    ['純利益 (百万)', 93736000000.0, 96995000000.0, 99803000000.0, 94680000000.0],
    ['売上高 (百万)', 391035000000.0, 383285000000.0, 394328000000.0, 365817000000.0]
]

company_name = "Apple"  # ユーザーによる入力

# テンプレートにデータを埋め込む
html_content = template.render(company_name=company_name, data=data)

# HTMLファイルとして保存
with open('output/stock_data.html', 'w', encoding='utf-8') as f:
    f.write(html_content)

print("HTMLファイルが生成されました")
